app/Http/Controllers/CartController.php

    public function save(request $request)
    {
        $request->validate([
            'product_variation_id'=> 'required'
        ]);

        $cart = \App\Models\Cart::firstOrCreate([
            'session_id'=> session()->getId()
        ]);



        $cart->photoVariations()->syncWithoutDetaching($request->product_variation_id);
---
insert into `cart_photo` (`cart_id`, `photo_variation_id`) values (2, 1)

    public function destroy(request $request)
    {
        $cart = \App\Models\Cart::where('session_id',session()->getId())->first();
        $cart->photoVariations()->detach($request->id);
---
select * from `carts` where `session_id` = '9NaxDBloxVqIcb4cGIFGoaguBCmyzgMjoS4hOihz' limit 1
delete from `cart_photo` where `cart_id` = 2 and `photo_variation_id` in ('1')